<script>
    const vocabulary = {
        title: {
            ru: "Заглавок",
            ua: "Заголовок"
        },
        menu_areas: {
            ru: "Направления деятельности",
            ua: "Напрямки діяльності"
        },
        menu_masters: {
            ru: "Мастера",
            ua: "Майстри"
        },
        menu_studies: {
            ru: "Обучения",
            ua: "Навчання"
        },
        menu_info: {
            ru: "Полезная информация",
            ua: "Корисна інформація"
        },
        menu_events: {
            ru: "События",
            ua: "Події"
        },
        menu_register: {
            ru: "Регистрация",
            ua: "Реєстрація"
        },
        menu_login: {
            ru: "Вход",
            ua: "Вхід"
        },
        menu_logout: {
            ru: "Выйти",
            ua: "Вийти"
        },
        menu_notes_to_chief: {
            ru: "Мои записи",
            ua: "Мої записи"
        },


        //addedd by alex_blob
        success_chief_note: {
            ru: "Вы успешно отправили заявку на прийом к Валерию! Менеджер свяжется с вами для уточнения даты и времени!",
            ua: "Ви успішно надіслали запит на прийом до Валерія! Адміністратор зв'яжеться з Вами для підтвердження дати та часу!"
        },
        error_chief_note: {
            "-1": {
                ru: "Дата не найдена!",
                ua: "Дату не знайдено!"
            },
            "-2_p1": {
                ru: "Вы уже сделали запись на ",
                ua: "Ви вже зробили запис на "
            },
            "-2_p2": {
                ru: "! Для записи на следующую дату дождитесь указанной даты или отклонения записи администратором!",
                ua: "! Для запису на наступну дату, дочекайтесь вказаної дати або відхилення запису адміністратором!"
            },
            "-3": {
                ru: "Запись на выбранное время сделать нельзя!",
                ua: "Запис на вибраний час зробити не можна!"
            },
            "-5": {
                ru: "Что-то пошло не так! Обновите страницу и повторите попытку!",
                ua: "Щось пішло не так! Оновіть сторінку та спробуйте ще раз!"
            }
        },
        success_master_note: {
            ru: "Вы успешно отправили заявку на прийом к мастеру! Менеджер свяжется с вами для уточнения даты и времени!",
            ua: "Ви успішно надіслали запит на прийом до майстра! Адміністратор зв'яжеться з Вами для підтвердження дати та часу!"
        },
        error_master_note: {
            "-1": {
                ru: "Мастер не найден!",
                ua: "Майстра не знайдено!"
            },
            "-2": {
                ru: "Вы уже отправили запрос на запись к мастеру! Подождите, пока администратор позвонит по телефону для согласования времени и места!",
                ua: "Ви вже відправили запит на запис до майстра! Зачекайте, поки адміністратор зателефонує Вам для узгодження часу і місця!"
            },
            "-5": {
                ru: "Что-то пошло не так! Обновите страницу и повторите попытку!",
                ua: "Щось пішло не так! Оновіть сторінку та спробуйте ще раз!"
            }
        },
        success_study_note: {
            ru: "Вы успешно отправили заявку на запись на семинар! Менеджер свяжется с вами для уточнения даты и времени!",
            ua: "Ви успішно надіслали запит на запис на семінар! Адміністратор зв'яжеться з Вами для підтвердження дати та часу!"
        },
        error_study_note: {
            "-1": {
                ru: "Семінар не найден!",
                ua: "Семинар не знайдено!"
            },
            "-2": {
                ru: "Вы уже отправили запрос на запись на семинар! Подождите, пока администратор позвонит по телефону для согласования времени и места!",
                ua: "Ви вже відправили запит на запис на семінар! Зачекайте, поки адміністратор зателефонує Вам для узгодження часу і місця!"
            },
            "-3": {
                ru:"Вы уже записаны на данный курс обучения!",
                ua:"Ви вже записані на даний курс навчання!"
            },
            "-4": {
                ru: "К сожалению, вас не приняты к курсу, если считаете, что возникла ошибка, позвоните администратору!",
                ua: "На жаль, вас не прийнято до курсу, якщо вважаєте, що виникла помилка, зателефонуйте адміністратору!"
            },
            "-5": {
                ru: "Что-то пошло не так! Обновите страницу и повторите попытку!",
                ua: "Щось пішло не так! Оновіть сторінку та спробуйте ще раз!"
            }
        },
        //addedd by alex_blob
    }
</script>
